In [1]:
import pandas as pd

In [2]:
data = pd.read_csv(r"Titanic_train.csv", index_col=0)
data.index = range(len(data))
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data['Family'] = data['SibSp'] + data['Parch']
data.drop(labels=['SibSp','Parch', 'Name', 'Ticket'], axis=1, inplace=True)
data.head()

   Survived  Pclass     Sex   Age     Fare Cabin Embarked  Family
0         0       3    male  22.0   7.2500   NaN        S       1
1         1       1  female  38.0  71.2833   C85        C       1
2         1       3  female  26.0   7.9250   NaN        S       0
3         1       1  female  35.0  53.1000  C123        S       1
4         0       3    male  35.0   8.0500   NaN        S       0

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   Fare      891 non-null    float64
 5   Cabin     204 non-null    object
 6   Embarked  889 non-null    object
 7   Family    891 non-null    int64
dtypes: float64(2), int64(3), object(3)
memory usage: 55.8+ KB

In [5]:
from sklearn.impute import SimpleImputer
Age = data.loc[:,'Age'].values.reshape(-1,1)
imp_median = SimpleImputer(strategy='median')
imp_median = imp_median.fit_transform(Age)
data.loc[:,'Age'] = imp_median

In [6]:
Embarked = data.loc[:,'Embarked'].values.reshape(-1,1)
imp_most = SimpleImputer(strategy='most_frequent')
imp_most = imp_most.fit_transform(Embarked)
data.loc[:,'Embarked'] = imp_most

In [7]:
data.drop(labels=['Cabin'],axis=1,inplace=True)

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   Fare      891 non-null    float64
 5   Embarked  891 non-null    object
 6   Family    891 non-null    int64
dtypes: float64(2), int64(3), object(2)
memory usage: 48.9+ KB